app/Controllers/Agenda.php

SELECT *
FROM `agenda`
---
    public function getAllAgenda()
    {
        $model = new AgendaModel();
        $data = $model->findAll();