app/Controllers/Bidang.php

    public function getAllBidang()
    {
        $model = new BidangModel();
        $data = $model->findAll();
---
SELECT *
FROM `bidang`